slackGPT/revalidation_denied/21 DocIssuance_IssueTicket Request.xml

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <soap-env:Header>
        <ns0:MessageID xmlns:ns0="http://www.w3.org/2005/08/addressing">a2778b81-a81a-48bd-beae-05b2f524a3d6
        </ns0:MessageID>
        <ns1:Action xmlns:ns1="http://www.w3.org/2005/08/addressing">http://webservices.amadeus.com/TTKTIQ_15_1_1A
        </ns1:Action>
        <ns2:To xmlns:ns2="http://www.w3.org/2005/08/addressing">
            https://nodeD3.production.webservices.amadeus.com/1ASIWVPKVPK
        </ns2:To>
        <wsse:Session xmlns:wsse="http://xml.amadeus.com/2010/06/Session_v3" TransactionStatusCode="InSeries">
            <wsse:SessionId>0H4IECITVO</wsse:SessionId>
            <wsse:SequenceNumber>11</wsse:SequenceNumber>
            <wsse:SecurityToken>2TPYISLQY0A5W1OBWRK8ISPJG2</wsse:SecurityToken>
        </wsse:Session>
    </soap-env:Header>
    <soap-env:Body>
        <ns0:DocIssuance_IssueTicket xmlns:ns0="http://xml.amadeus.com/TTKTIQ_15_1_1A">
            <ns0:selection>
                <ns0:referenceDetails>
                    <ns0:type>L</ns0:type>
                    <ns0:value>18</ns0:value>
                </ns0:referenceDetails>
            </ns0:selection>
            <ns0:selection>
                <ns0:referenceDetails>
                    <ns0:type>ST</ns0:type>
                    <ns0:value>5</ns0:value>
                </ns0:referenceDetails>
                <ns0:referenceDetails>
                    <ns0:type>ST</ns0:type>
                    <ns0:value>6</ns0:value>
                </ns0:referenceDetails>
            </ns0:selection>
            <ns0:selection>
                <ns0:referenceDetails>
                    <ns0:type>C</ns0:type>
                    <ns0:value>1</ns0:value>
                </ns0:referenceDetails>
                <ns0:referenceDetails>
                    <ns0:type>C</ns0:type>
                    <ns0:value>2</ns0:value>
                </ns0:referenceDetails>
            </ns0:selection>
            <ns0:optionGroup>
                <ns0:switches>
                    <ns0:statusDetails>
                        <ns0:indicator>ETR</ns0:indicator>
                    </ns0:statusDetails>
                </ns0:switches>
            </ns0:optionGroup>
        </ns0:DocIssuance_IssueTicket>
    </soap-env:Body>
</soap-env:Envelope>
